{
    "appActionIfIosDeviceModelNotAllowed": "block",
    "appDataEncryptionType": "whenDeviceLocked",
    "customBrowserProtocol": "",
    "customDialerAppProtocol": "",
    "deployedAppCount": 1,
    "disableProtectionOfManagedOutboundOpenInData": false,
    "exemptedAppProtocols": [
        {
            "name": "Default",
            "value": "skype;app-settings;calshow;itms;itmss;itms-apps;itms-appss;itms-services;"
        }
    ],
    "exemptedUniversalLinks": [
        "http://facetime.apple.com",
        "http://maps.apple.com",
        "https://facetime.apple.com",
        "https://maps.apple.com"
    ],
    "faceIdBlocked": false,
    "filterOpenInToOnlyManagedApps": false,
    "managedUniversalLinks": [
        "http://*.appsplatform.us/*",
        "http://*.onedrive.com/*",
        "http://*.powerapps.cn/*",
        "http://*.powerapps.com/*",
        "http://*.powerapps.us/*",
        "http://*.powerbi.com/*",
        "http://*.service-now.com/*",
        "http://*.sharepoint-df.com/*",
        "http://*.sharepoint.com/*",
        "http://*.yammer.com/*",
        "http://*.zoom.us/*",
        "http://*collab.apps.mil/l/*",
        "http://*devspaces.skype.com/l/*",
        "http://*teams-fl.microsoft.com/l/*",
        "http://*teams.live.com/l/*",
        "http://*teams.microsoft.com/l/*",
        "http://*teams.microsoft.us/l/*",
        "http://app.powerbi.cn/*",
        "http://app.powerbi.de/*",
        "http://app.powerbigov.us/*",
        "http://msit.microsoftstream.com/video/*",
        "http://tasks.office.com/*",
        "http://to-do.microsoft.com/sharing*",
        "http://web.microsoftstream.com/video/*",
        "http://zoom.us/*",
        "https://*.appsplatform.us/*",
        "https://*.onedrive.com/*",
        "https://*.powerapps.cn/*",
        "https://*.powerapps.com/*",
        "https://*.powerapps.us/*",
        "https://*.powerbi.com/*",
        "https://*.service-now.com/*",
        "https://*.sharepoint-df.com/*",
        "https://*.sharepoint.com/*",
        "https://*.yammer.com/*",
        "https://*.zoom.us/*",
        "https://*collab.apps.mil/l/*",
        "https://*devspaces.skype.com/l/*",
        "https://*teams-fl.microsoft.com/l/*",
        "https://*teams.live.com/l/*",
        "https://*teams.microsoft.com/l/*",
        "https://*teams.microsoft.us/l/*",
        "https://app.powerbi.cn/*",
        "https://app.powerbi.de/*",
        "https://app.powerbigov.us/*",
        "https://msit.microsoftstream.com/video/*",
        "https://tasks.office.com/*",
        "https://to-do.microsoft.com/sharing*",
        "https://web.microsoftstream.com/video/*",
        "https://zoom.us/*"
    ],
    "protectInboundDataFromUnknownSources": false,
    "thirdPartyKeyboardsBlocked": false,
    "apps": [
        {
            "mobileAppIdentifier": {
                "bundleId": "com.getdropbox.dropbox",
                "@odata.type": "#microsoft.graph.iosMobileAppIdentifier"
            },
            "version": "2035993534",
            "id": "com.getdropbox.dropbox.ios"
        }
    ],
    "appGroupType": "selectedPublicApps",
    "isAssigned": false,
    "targetedAppManagementLevels": "unspecified",
    "allowedDataIngestionLocations": [
        "oneDriveForBusiness",
        "sharePoint",
        "camera",
        "photoLibrary"
    ],
    "allowedDataStorageLocations": [
        "oneDriveForBusiness",
        "sharePoint"
    ],
    "allowedInboundDataTransferSources": "allApps",
    "allowedOutboundClipboardSharingExceptionLength": 0,
    "allowedOutboundClipboardSharingLevel": "managedApps",
    "allowedOutboundDataTransferDestinations": "managedApps",
    "appActionIfDeviceComplianceRequired": "block",
    "appActionIfMaximumPinRetriesExceeded": "block",
    "blockDataIngestionIntoOrganizationDocuments": false,
    "contactSyncBlocked": false,
    "dataBackupBlocked": true,
    "deviceComplianceRequired": true,
    "dialerRestrictionLevel": "blocked",
    "disableAppPinIfDevicePinIsSet": false,
    "fingerprintBlocked": false,
    "managedBrowser": "microsoftEdge",
    "managedBrowserToOpenLinksRequired": true,
    "maximumAllowedDeviceThreatLevel": "notConfigured",
    "maximumPinRetries": 10,
    "minimumPinLength": 4,
    "mobileThreatDefenseRemediationAction": "block",
    "notificationRestriction": "allow",
    "organizationalCredentialsRequired": false,
    "periodBeforePinReset": "PT0S",
    "periodOfflineBeforeAccessCheck": "P5D",
    "periodOfflineBeforeWipeIsEnforced": "P90D",
    "periodOnlineBeforeAccessCheck": "PT30M",
    "pinCharacterSet": "numeric",
    "pinRequired": false,
    "pinRequiredInsteadOfBiometricTimeout": "PT30M",
    "previousPinBlockCount": 0,
    "printBlocked": true,
    "saveAsBlocked": true,
    "simplePinBlocked": false,
    "description": "",
    "displayName": "DropBox - App Protection Policy - iOS/iPadOS",
    "version": "\"a30055c4-0000-0100-0000-66b268550000\"",
    "@odata.type": "microsoft.graph.iosManagedAppProtection",
    "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/iosManagedAppProtections(apps())/$entity",
    "protectedMessagingRedirectAppType": "blocked",
    "allowWidgetContentSync": true,
    "appActionIfAccountIsClockedOut": null,
    "messagingRedirectAppUrlScheme": "",
    "apps@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/iosManagedAppProtections('T_e83a51dd-ad0e-4df1-a218-5a6146914252')/apps"
}