{
    "accountBlockModification": false,
    "activationLockAllowWhenSupervised": false,
    "airDropBlocked": false,
    "airDropForceUnmanagedDropTarget": true,
    "airPlayForcePairingPasswordForOutgoingRequests": false,
    "airPrintBlockCredentialsStorage": false,
    "airPrintBlocked": false,
    "airPrintBlockiBeaconDiscovery": false,
    "airPrintForceTrustedTLS": false,
    "appClipsBlocked": false,
    "appleNewsBlocked": false,
    "applePersonalizedAdsBlocked": false,
    "appleWatchBlockPairing": false,
    "appleWatchForceWristDetection": false,
    "appRemovalBlocked": false,
    "appsSingleAppModeList": [],
    "appStoreBlockAutomaticDownloads": false,
    "appStoreBlocked": false,
    "appStoreBlockInAppPurchases": false,
    "appStoreBlockUIAppInstallation": false,
    "appStoreRequirePassword": false,
    "appsVisibilityList": [],
    "appsVisibilityListType": "none",
    "autoFillForceAuthentication": false,
    "autoUnlockBlocked": false,
    "blockSystemAppRemoval": false,
    "bluetoothBlockModification": false,
    "cameraBlocked": false,
    "cellularBlockDataRoaming": false,
    "cellularBlockGlobalBackgroundFetchWhileRoaming": false,
    "cellularBlockPerAppDataModification": false,
    "cellularBlockPersonalHotspot": false,
    "cellularBlockPersonalHotspotModification": false,
    "cellularBlockPlanModification": false,
    "cellularBlockVoiceRoaming": false,
    "certificatesBlockUntrustedTlsCertificates": false,
    "classroomAppBlockRemoteScreenObservation": false,
    "classroomAppForceUnpromptedScreenObservation": false,
    "classroomForceAutomaticallyJoinClasses": false,
    "classroomForceRequestPermissionToLeaveClasses": false,
    "classroomForceUnpromptedAppAndDeviceLock": false,
    "compliantAppListType": "none",
    "compliantAppsList": [],
    "configurationProfileBlockChanges": false,
    "contactsAllowManagedToUnmanagedWrite": false,
    "contactsAllowUnmanagedToManagedRead": false,
    "continuousPathKeyboardBlocked": false,
    "dateAndTimeForceSetAutomatically": false,
    "definitionLookupBlocked": false,
    "deviceBlockEnableRestrictions": false,
    "deviceBlockEraseContentAndSettings": false,
    "deviceBlockNameModification": false,
    "diagnosticDataBlockSubmission": false,
    "diagnosticDataBlockSubmissionModification": false,
    "documentsBlockManagedDocumentsInUnmanagedApps": true,
    "documentsBlockUnmanagedDocumentsInManagedApps": false,
    "emailInDomainSuffixes": [],
    "enterpriseAppBlockTrust": false,
    "enterpriseAppBlockTrustModification": false,
    "enterpriseBookBlockBackup": false,
    "enterpriseBookBlockMetadataSync": false,
    "esimBlockModification": false,
    "faceTimeBlocked": false,
    "filesNetworkDriveAccessBlocked": false,
    "filesUsbDriveAccessBlocked": false,
    "findMyDeviceInFindMyAppBlocked": false,
    "findMyFriendsBlocked": false,
    "findMyFriendsInFindMyAppBlocked": false,
    "gameCenterBlocked": true,
    "gamingBlockGameCenterFriends": true,
    "gamingBlockMultiplayer": true,
    "hostPairingBlocked": false,
    "iBooksStoreBlocked": false,
    "iBooksStoreBlockErotica": true,
    "iCloudBlockActivityContinuation": false,
    "iCloudBlockBackup": false,
    "iCloudBlockDocumentSync": false,
    "iCloudBlockManagedAppsSync": false,
    "iCloudBlockPhotoLibrary": false,
    "iCloudBlockPhotoStreamSync": false,
    "iCloudBlockSharedPhotoStream": false,
    "iCloudPrivateRelayBlocked": false,
    "iCloudRequireEncryptedBackup": false,
    "iTunesBlocked": false,
    "iTunesBlockExplicitContent": false,
    "iTunesBlockMusicService": false,
    "iTunesBlockRadio": false,
    "keyboardBlockAutoCorrect": false,
    "keyboardBlockDictation": false,
    "keyboardBlockPredictive": false,
    "keyboardBlockShortcuts": false,
    "keyboardBlockSpellCheck": false,
    "keychainBlockCloudSync": false,
    "kioskModeAllowAssistiveSpeak": false,
    "kioskModeAllowAssistiveTouchSettings": false,
    "kioskModeAllowAutoLock": false,
    "kioskModeAllowColorInversionSettings": false,
    "kioskModeAllowRingerSwitch": false,
    "kioskModeAllowScreenRotation": false,
    "kioskModeAllowSleepButton": false,
    "kioskModeAllowTouchscreen": false,
    "kioskModeAllowVoiceControlModification": false,
    "kioskModeAllowVoiceOverSettings": false,
    "kioskModeAllowVolumeButtons": false,
    "kioskModeAllowZoomSettings": false,
    "kioskModeAppType": "notConfigured",
    "kioskModeBlockAutoLock": false,
    "kioskModeBlockRingerSwitch": false,
    "kioskModeBlockScreenRotation": false,
    "kioskModeBlockSleepButton": false,
    "kioskModeBlockTouchscreen": false,
    "kioskModeBlockVolumeButtons": false,
    "kioskModeEnableVoiceControl": false,
    "kioskModeRequireAssistiveTouch": false,
    "kioskModeRequireColorInversion": false,
    "kioskModeRequireMonoAudio": false,
    "kioskModeRequireVoiceOver": false,
    "kioskModeRequireZoom": false,
    "lockScreenBlockControlCenter": false,
    "lockScreenBlockNotificationView": false,
    "lockScreenBlockPassbook": false,
    "lockScreenBlockTodayView": false,
    "managedPasteboardRequired": true,
    "mediaContentRatingApps": "allAllowed",
    "messagesBlocked": false,
    "networkUsageRules": [],
    "nfcBlocked": false,
    "notificationsBlockSettingsModification": false,
    "onDeviceOnlyDictationForced": false,
    "onDeviceOnlyTranslationForced": false,
    "passcodeBlockFingerprintModification": false,
    "passcodeBlockFingerprintUnlock": false,
    "passcodeBlockModification": false,
    "passcodeBlockSimple": true,
    "passcodeExpirationDays": 365,
    "passcodeMinimumLength": 8,
    "passcodeMinutesOfInactivityBeforeLock": 60,
    "passcodeMinutesOfInactivityBeforeScreenTimeout": 15,
    "passcodePreviousPasscodeBlockCount": 3,
    "passcodeRequired": true,
    "passcodeRequiredType": "alphanumeric",
    "passcodeSignInFailureCountBeforeWipe": 11,
    "passwordBlockAirDropSharing": false,
    "passwordBlockAutoFill": false,
    "passwordBlockProximityRequests": false,
    "pkiBlockOTAUpdates": false,
    "podcastsBlocked": false,
    "privacyForceLimitAdTracking": false,
    "proximityBlockSetupToNewDevice": false,
    "safariBlockAutofill": false,
    "safariBlocked": false,
    "safariBlockJavaScript": false,
    "safariBlockPopups": false,
    "safariCookieSettings": "browserDefault",
    "safariManagedDomains": [],
    "safariPasswordAutoFillDomains": [],
    "safariRequireFraudWarning": false,
    "screenCaptureBlocked": false,
    "sharedDeviceBlockTemporarySessions": false,
    "siriBlocked": false,
    "siriBlockedWhenLocked": false,
    "siriBlockUserGeneratedContent": false,
    "siriRequireProfanityFilter": false,
    "softwareUpdatesForceDelayed": false,
    "spotlightBlockInternetResults": false,
    "unpairedExternalBootToRecoveryAllowed": false,
    "usbRestrictedModeBlocked": false,
    "voiceDialingBlocked": false,
    "vpnBlockCreation": false,
    "wallpaperBlockModification": false,
    "wiFiConnectOnlyToConfiguredNetworks": false,
    "wiFiConnectToAllowedNetworksOnlyForced": false,
    "wifiPowerOnForced": false,
    "description": "",
    "displayName": "iOS - Device Restrictions Profile",
    "@odata.type": "#microsoft.graph.iosGeneralDeviceConfiguration"
}