{
    "description": "",
    "deviceNameTemplate": "Name-%SERIAL%",
    "deviceType": "windowsPc",
    "displayName": "Autopilot User Driven Profile",
    "enableWhiteGlove": false,
    "extractHardwareHash": false,
    "language": "os-default",
    "outOfBoxExperienceSettings": {
        "deviceUsageType": "singleUser",
        "hideEscapeLink": true,
        "hideEULA": true,
        "hidePrivacySettings": true,
        "skipKeyboardSelectionPage": true,
        "userType": "standard"
    },
    "@odata.type": "#microsoft.graph.azureADWindowsAutopilotDeploymentProfile"
}