{
    "allowedGoogleAccountDomains": [],
    "blockUnifiedPasswordForWorkProfile": false,
    "passwordBlockFaceUnlock": false,
    "passwordBlockFingerprintUnlock": false,
    "passwordBlockIrisUnlock": false,
    "passwordBlockTrustAgents": false,
    "passwordExpirationDays": 365,
    "passwordMinimumLength": 8,
    "passwordMinutesOfInactivityBeforeScreenTimeout": 60,
    "passwordPreviousPasswordBlockCount": 3,
    "passwordRequiredType": "atLeastAlphanumeric",
    "passwordSignInFailureCountBeforeFactoryReset": 11,
    "requiredPasswordComplexity": "medium",
    "securityRequireVerifyApps": true,
    "vpnEnableAlwaysOnLockdownMode": false,
    "workProfileAccountUse": "allowAllExceptGoogleAccounts",
    "workProfileAllowAppInstallsFromUnknownSources": false,
    "workProfileAllowWidgets": false,
    "workProfileBlockAddingAccounts": false,
    "workProfileBlockCamera": false,
    "workProfileBlockCrossProfileCallerId": false,
    "workProfileBlockCrossProfileContactsSearch": false,
    "workProfileBlockCrossProfileCopyPaste": true,
    "workProfileBlockNotificationsWhileDeviceLocked": false,
    "workProfileBlockPersonalAppInstallsFromUnknownSources": true,
    "workProfileBlockScreenCapture": true,
    "workProfileBluetoothEnableContactSharing": false,
    "workProfileDataSharingType": "deviceDefault",
    "workProfileDefaultAppPermissionPolicy": "deviceDefault",
    "workProfilePasswordBlockFaceUnlock": false,
    "workProfilePasswordBlockFingerprintUnlock": false,
    "workProfilePasswordBlockIrisUnlock": false,
    "workProfilePasswordBlockTrustAgents": false,
    "workProfilePasswordExpirationDays": 365,
    "workProfilePasswordMinimumLength": 8,
    "workProfilePasswordMinutesOfInactivityBeforeScreenTimeout": 60,
    "workProfilePasswordPreviousPasswordBlockCount": 3,
    "workProfilePasswordRequiredType": "atLeastAlphanumeric",
    "workProfilePasswordSignInFailureCountBeforeFactoryReset": 11,
    "workProfileRequiredPasswordComplexity": "medium",
    "workProfileRequirePassword": true,
    "description": "",
    "displayName": "Android - BYOD - Device Restrictions Profile",
    "@odata.type": "#microsoft.graph.androidWorkProfileGeneralDeviceConfiguration"
}