{
    "androidDeviceOwnerDelegatedScopeAppSettings": [],
    "azureAdSharedDeviceDataClearApps": [],
    "bluetoothBlockContactSharing": true,
    "crossProfilePoliciesAllowDataSharing": "notConfigured",
    "enrollmentProfile": "notConfigured",
    "factoryResetDeviceAdministratorEmails": [],
    "googleAccountsBlocked": true,
    "kioskCustomizationStatusBar": "notConfigured",
    "kioskCustomizationSystemNavigation": "notConfigured",
    "kioskModeAppPositions": [],
    "kioskModeApps": [],
    "kioskModeManagedFolders": [],
    "kioskModeUseManagedHomeScreenApp": "notConfigured",
    "kioskModeWifiAllowedSsids": [],
    "locateDeviceLostModeEnabled": true,
    "passwordBlockKeyguardFeatures": [],
    "passwordExpirationDays": 365,
    "passwordMinimumLength": 8,
    "passwordMinutesOfInactivityBeforeScreenTimeout": 60,
    "passwordPreviousPasswordCountToBlock": 3,
    "passwordRequiredType": "alphanumeric",
    "passwordRequireUnlock": "deviceDefault",
    "passwordSignInFailureCountBeforeFactoryReset": 11,
    "personalProfilePersonalApplications": [],
    "personalProfilePlayStoreMode": "notConfigured",
    "personalProfileScreenCaptureBlocked": true,
    "playStoreMode": "blockList",
    "screenCaptureBlocked": false,
    "securityDeveloperSettingsEnabled": false,
    "securityRequireVerifyApps": true,
    "stayOnModes": [],
    "storageBlockUsbFileTransfer": true,
    "systemUpdateFreezePeriods": [],
    "vpnAlwaysOnLockdownMode": false,
    "vpnAlwaysOnPackageIdentifier": "",
    "workProfilePasswordExpirationDays": 365,
    "workProfilePasswordMinimumLength": 8,
    "workProfilePasswordPreviousPasswordCountToBlock": 3,
    "workProfilePasswordRequiredType": "alphanumeric",
    "workProfilePasswordRequireUnlock": "deviceDefault",
    "workProfilePasswordSignInFailureCountBeforeFactoryReset": 11,
    "description": "",
    "displayName": "Android - Company Owned - Device Restrictions Policy",
    "@odata.type": "#microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration"
}