{
    "applicationGuardAllowFileSaveOnHost": false,
    "applicationGuardAllowPersistence": false,
    "applicationGuardAllowPrintToLocalPrinters": false,
    "applicationGuardAllowPrintToNetworkPrinters": false,
    "applicationGuardAllowPrintToPDF": false,
    "applicationGuardAllowPrintToXPS": false,
    "applicationGuardAllowVirtualGPU": false,
    "applicationGuardBlockClipboardSharing": "notConfigured",
    "applicationGuardBlockFileTransfer": "notConfigured",
    "applicationGuardBlockNonEnterpriseContent": false,
    "applicationGuardCertificateThumbprints": [],
    "applicationGuardEnabled": false,
    "applicationGuardEnabledOptions": "notConfigured",
    "applicationGuardForceAuditing": false,
    "appLockerApplicationControl": "notConfigured",
    "bitLockerAllowStandardUserEncryption": false,
    "bitLockerDisableWarningForOtherDiskEncryption": false,
    "bitLockerEnableStorageCardEncryptionOnMobile": false,
    "bitLockerEncryptDevice": false,
    "bitLockerFixedDrivePolicy": {
        "requireEncryptionForWriteAccess": false
    },
    "bitLockerRecoveryPasswordRotation": "notConfigured",
    "bitLockerRemovableDrivePolicy": {
        "blockCrossOrganizationWriteAccess": false,
        "requireEncryptionForWriteAccess": false
    },
    "bitLockerSystemDrivePolicy": {
        "prebootRecoveryEnableMessageAndUrl": false,
        "startupAuthenticationBlockWithoutTpmChip": false,
        "startupAuthenticationRequired": false,
        "startupAuthenticationTpmKeyUsage": "blocked",
        "startupAuthenticationTpmPinAndKeyUsage": "blocked",
        "startupAuthenticationTpmPinUsage": "blocked",
        "startupAuthenticationTpmUsage": "blocked"
    },
    "defenderAdditionalGuardedFolders": [],
    "defenderAdobeReaderLaunchChildProcess": "notConfigured",
    "defenderAdvancedRansomewareProtectionType": "notConfigured",
    "defenderAttackSurfaceReductionExcludedPaths": [],
    "defenderBlockPersistenceThroughWmiType": "userDefined",
    "defenderEmailContentExecution": "userDefined",
    "defenderEmailContentExecutionType": "userDefined",
    "defenderFileExtensionsToExclude": [],
    "defenderFilesAndFoldersToExclude": [],
    "defenderGuardedFoldersAllowedAppPaths": [],
    "defenderGuardMyFoldersType": "userDefined",
    "defenderNetworkProtectionType": "notConfigured",
    "defenderOfficeAppsExecutableContentCreationOrLaunch": "userDefined",
    "defenderOfficeAppsExecutableContentCreationOrLaunchType": "userDefined",
    "defenderOfficeAppsLaunchChildProcess": "userDefined",
    "defenderOfficeAppsLaunchChildProcessType": "userDefined",
    "defenderOfficeAppsOtherProcessInjection": "userDefined",
    "defenderOfficeAppsOtherProcessInjectionType": "userDefined",
    "defenderOfficeCommunicationAppsLaunchChildProcess": "notConfigured",
    "defenderOfficeMacroCodeAllowWin32Imports": "userDefined",
    "defenderOfficeMacroCodeAllowWin32ImportsType": "userDefined",
    "defenderPreventCredentialStealingType": "notConfigured",
    "defenderProcessCreation": "userDefined",
    "defenderProcessCreationType": "userDefined",
    "defenderProcessesToExclude": [],
    "defenderScriptDownloadedPayloadExecution": "userDefined",
    "defenderScriptDownloadedPayloadExecutionType": "userDefined",
    "defenderScriptObfuscatedMacroCode": "userDefined",
    "defenderScriptObfuscatedMacroCodeType": "userDefined",
    "defenderSecurityCenterBlockExploitProtectionOverride": false,
    "defenderSecurityCenterITContactDisplay": "notConfigured",
    "defenderSecurityCenterNotificationsFromApp": "notConfigured",
    "defenderUntrustedExecutable": "userDefined",
    "defenderUntrustedExecutableType": "userDefined",
    "defenderUntrustedUSBProcess": "userDefined",
    "defenderUntrustedUSBProcessType": "userDefined",
    "deviceGuardEnableSecureBootWithDMA": false,
    "deviceGuardEnableVirtualizationBasedSecurity": false,
    "deviceGuardLaunchSystemGuard": "notConfigured",
    "deviceGuardLocalSystemAuthorityCredentialGuardSettings": "notConfigured",
    "deviceGuardSecureBootWithDMA": "notConfigured",
    "dmaGuardDeviceEnumerationPolicy": "deviceDefault",
    "firewallCertificateRevocationListCheckMethod": "deviceDefault",
    "firewallIPSecExemptionsAllowDHCP": false,
    "firewallIPSecExemptionsAllowICMP": false,
    "firewallIPSecExemptionsAllowNeighborDiscovery": false,
    "firewallIPSecExemptionsAllowRouterDiscovery": false,
    "firewallIPSecExemptionsNone": false,
    "firewallPacketQueueingMethod": "deviceDefault",
    "firewallPreSharedKeyEncodingMethod": "deviceDefault",
    "firewallProfileDomain": {
        "authorizedApplicationRulesFromGroupPolicyMerged": false,
        "authorizedApplicationRulesFromGroupPolicyNotMerged": false,
        "connectionSecurityRulesFromGroupPolicyMerged": false,
        "connectionSecurityRulesFromGroupPolicyNotMerged": false,
        "firewallEnabled": "allowed",
        "globalPortRulesFromGroupPolicyMerged": false,
        "globalPortRulesFromGroupPolicyNotMerged": false,
        "inboundConnectionsBlocked": false,
        "inboundConnectionsRequired": false,
        "inboundNotificationsBlocked": false,
        "inboundNotificationsRequired": false,
        "incomingTrafficBlocked": false,
        "incomingTrafficRequired": false,
        "outboundConnectionsBlocked": false,
        "outboundConnectionsRequired": false,
        "policyRulesFromGroupPolicyMerged": false,
        "policyRulesFromGroupPolicyNotMerged": false,
        "securedPacketExemptionAllowed": false,
        "securedPacketExemptionBlocked": false,
        "stealthModeBlocked": false,
        "stealthModeRequired": false,
        "unicastResponsesToMulticastBroadcastsBlocked": false,
        "unicastResponsesToMulticastBroadcastsRequired": false
    },
    "firewallProfilePrivate": {
        "authorizedApplicationRulesFromGroupPolicyMerged": false,
        "authorizedApplicationRulesFromGroupPolicyNotMerged": false,
        "connectionSecurityRulesFromGroupPolicyMerged": false,
        "connectionSecurityRulesFromGroupPolicyNotMerged": false,
        "firewallEnabled": "allowed",
        "globalPortRulesFromGroupPolicyMerged": false,
        "globalPortRulesFromGroupPolicyNotMerged": false,
        "inboundConnectionsBlocked": false,
        "inboundConnectionsRequired": false,
        "inboundNotificationsBlocked": false,
        "inboundNotificationsRequired": false,
        "incomingTrafficBlocked": false,
        "incomingTrafficRequired": false,
        "outboundConnectionsBlocked": false,
        "outboundConnectionsRequired": false,
        "policyRulesFromGroupPolicyMerged": false,
        "policyRulesFromGroupPolicyNotMerged": false,
        "securedPacketExemptionAllowed": false,
        "securedPacketExemptionBlocked": false,
        "stealthModeBlocked": false,
        "stealthModeRequired": false,
        "unicastResponsesToMulticastBroadcastsBlocked": false,
        "unicastResponsesToMulticastBroadcastsRequired": false
    },
    "firewallProfilePublic": {
        "authorizedApplicationRulesFromGroupPolicyMerged": false,
        "authorizedApplicationRulesFromGroupPolicyNotMerged": false,
        "connectionSecurityRulesFromGroupPolicyMerged": false,
        "connectionSecurityRulesFromGroupPolicyNotMerged": false,
        "firewallEnabled": "allowed",
        "globalPortRulesFromGroupPolicyMerged": false,
        "globalPortRulesFromGroupPolicyNotMerged": false,
        "inboundConnectionsBlocked": false,
        "inboundConnectionsRequired": false,
        "inboundNotificationsBlocked": false,
        "inboundNotificationsRequired": false,
        "incomingTrafficBlocked": false,
        "incomingTrafficRequired": false,
        "outboundConnectionsBlocked": false,
        "outboundConnectionsRequired": false,
        "policyRulesFromGroupPolicyMerged": false,
        "policyRulesFromGroupPolicyNotMerged": false,
        "securedPacketExemptionAllowed": false,
        "securedPacketExemptionBlocked": false,
        "stealthModeBlocked": false,
        "stealthModeRequired": false,
        "unicastResponsesToMulticastBroadcastsBlocked": false,
        "unicastResponsesToMulticastBroadcastsRequired": false
    },
    "firewallRules": [],
    "lanManagerAuthenticationLevel": "lmAndNltm",
    "lanManagerWorkstationDisableInsecureGuestLogons": false,
    "localSecurityOptionsAdministratorElevationPromptBehavior": "notConfigured",
    "localSecurityOptionsAllowAnonymousEnumerationOfSAMAccountsAndShares": false,
    "localSecurityOptionsAllowPKU2UAuthenticationRequests": false,
    "localSecurityOptionsAllowRemoteCallsToSecurityAccountsManagerHelperBool": false,
    "localSecurityOptionsAllowSystemToBeShutDownWithoutHavingToLogOn": false,
    "localSecurityOptionsAllowUIAccessApplicationElevation": false,
    "localSecurityOptionsAllowUIAccessApplicationsForSecureLocations": false,
    "localSecurityOptionsAllowUndockWithoutHavingToLogon": false,
    "localSecurityOptionsBlockMicrosoftAccounts": false,
    "localSecurityOptionsBlockRemoteLogonWithBlankPassword": false,
    "localSecurityOptionsBlockRemoteOpticalDriveAccess": false,
    "localSecurityOptionsBlockUsersInstallingPrinterDrivers": false,
    "localSecurityOptionsClearVirtualMemoryPageFile": false,
    "localSecurityOptionsClientDigitallySignCommunicationsAlways": false,
    "localSecurityOptionsClientSendUnencryptedPasswordToThirdPartySMBServers": false,
    "localSecurityOptionsDetectApplicationInstallationsAndPromptForElevation": false,
    "localSecurityOptionsDisableAdministratorAccount": false,
    "localSecurityOptionsDisableClientDigitallySignCommunicationsIfServerAgrees": false,
    "localSecurityOptionsDisableGuestAccount": false,
    "localSecurityOptionsDisableServerDigitallySignCommunicationsAlways": false,
    "localSecurityOptionsDisableServerDigitallySignCommunicationsIfClientAgrees": false,
    "localSecurityOptionsDoNotAllowAnonymousEnumerationOfSAMAccounts": false,
    "localSecurityOptionsDoNotRequireCtrlAltDel": false,
    "localSecurityOptionsDoNotStoreLANManagerHashValueOnNextPasswordChange": false,
    "localSecurityOptionsFormatAndEjectOfRemovableMediaAllowedUser": "notConfigured",
    "localSecurityOptionsHideLastSignedInUser": false,
    "localSecurityOptionsHideUsernameAtSignIn": false,
    "localSecurityOptionsInformationDisplayedOnLockScreen": "notConfigured",
    "localSecurityOptionsInformationShownOnLockScreen": "notConfigured",
    "localSecurityOptionsMinimumSessionSecurityForNtlmSspBasedClients": "none",
    "localSecurityOptionsMinimumSessionSecurityForNtlmSspBasedServers": "none",
    "localSecurityOptionsOnlyElevateSignedExecutables": false,
    "localSecurityOptionsRestrictAnonymousAccessToNamedPipesAndShares": false,
    "localSecurityOptionsSmartCardRemovalBehavior": "noAction",
    "localSecurityOptionsStandardUserElevationPromptBehavior": "notConfigured",
    "localSecurityOptionsSwitchToSecureDesktopWhenPromptingForElevation": false,
    "localSecurityOptionsUseAdminApprovalMode": false,
    "localSecurityOptionsUseAdminApprovalModeForAdministrators": false,
    "localSecurityOptionsVirtualizeFileAndRegistryWriteFailuresToPerUserLocations": false,
    "smartScreenBlockOverrideForFiles": false,
    "smartScreenEnableInShell": false,
    "windowsDefenderTamperProtection": "notConfigured",
    "xboxServicesAccessoryManagementServiceStartupMode": "manual",
    "xboxServicesEnableXboxGameSaveTask": false,
    "xboxServicesLiveAuthManagerServiceStartupMode": "manual",
    "xboxServicesLiveGameSaveServiceStartupMode": "manual",
    "xboxServicesLiveNetworkingServiceStartupMode": "manual",
    "description": "",
    "displayName": "Windows - Enable Windows Firewall",
    "@odata.type": "#microsoft.graph.windows10EndpointProtectionConfiguration"
}