{
    "description": "",
    "name": "Windows - Default Power Plan",
    "platforms": "windows10",
    "settingCount": 13,
    "technologies": "mdm",
    "templateReference": {
        "templateFamily": "none",
        "templateId": ""
    },
    "settings": [
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "device_vendor_msft_policy_config_power_allowhibernate_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "device_vendor_msft_policy_config_power_allowhibernate",
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "0"
        },
        {
            "settingInstance": {
                "simpleSettingValue": {
                    "value": 15,
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue"
                },
                "settingDefinitionId": "device_vendor_msft_policy_config_power_energysaverbatterythresholdonbattery",
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance"
            },
            "id": "1"
        },
        {
            "settingInstance": {
                "simpleSettingValue": {
                    "value": 5,
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue"
                },
                "settingDefinitionId": "device_vendor_msft_policy_config_power_energysaverbatterythresholdpluggedin",
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance"
            },
            "id": "2"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "device_vendor_msft_policy_config_power_selectlidcloseactiononbattery_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "device_vendor_msft_policy_config_power_selectlidcloseactiononbattery",
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "3"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "device_vendor_msft_policy_config_power_selectlidcloseactionpluggedin_0",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "device_vendor_msft_policy_config_power_selectlidcloseactionpluggedin",
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "4"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "device_vendor_msft_policy_config_power_selectpowerbuttonactiononbattery_2",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "device_vendor_msft_policy_config_power_selectpowerbuttonactiononbattery",
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "5"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "device_vendor_msft_policy_config_power_selectpowerbuttonactionpluggedin_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "device_vendor_msft_policy_config_power_selectpowerbuttonactionpluggedin",
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "6"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "device_vendor_msft_policy_config_power_selectsleepbuttonactiononbattery_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "device_vendor_msft_policy_config_power_selectsleepbuttonactiononbattery",
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "7"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "device_vendor_msft_policy_config_power_selectsleepbuttonactionpluggedin_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "device_vendor_msft_policy_config_power_selectsleepbuttonactionpluggedin",
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "8"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "device_vendor_msft_policy_config_power_turnoffhybridsleeponbattery_0",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "device_vendor_msft_policy_config_power_turnoffhybridsleeponbattery",
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "9"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "device_vendor_msft_policy_config_power_turnoffhybridsleeppluggedin_0",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "device_vendor_msft_policy_config_power_turnoffhybridsleeppluggedin",
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "10"
        },
        {
            "settingInstance": {
                "simpleSettingValue": {
                    "value": 3600,
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue"
                },
                "settingDefinitionId": "device_vendor_msft_policy_config_power_unattendedsleeptimeoutonbattery",
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance"
            },
            "id": "11"
        },
        {
            "settingInstance": {
                "simpleSettingValue": {
                    "value": 0,
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue"
                },
                "settingDefinitionId": "device_vendor_msft_policy_config_power_unattendedsleeptimeoutpluggedin",
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance"
            },
            "id": "12"
        }
    ]
}