{
    "description": "",
    "name": "Windows - Default BitLocker Policy",
    "platforms": "windows10",
    "settingCount": 14,
    "technologies": "mdm",
    "templateReference": {
        "templateDisplayName": "BitLocker",
        "templateDisplayVersion": "Version 1",
        "templateFamily": "endpointSecurityDiskEncryption",
        "templateId": "46ddfc50-d10f-4867-b852-9434254b3bff_1"
    },
    "settings": [
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "device_vendor_msft_bitlocker_requiredeviceencryption_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "86da5fa5-67cf-48d1-8215-8787a9900ae6",
                        "useTemplateDefault": false
                    },
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "device_vendor_msft_bitlocker_requiredeviceencryption",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "20ec1f6e-0d7a-4b6f-9a4f-9ed33e69ce51"
                },
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "0"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "device_vendor_msft_bitlocker_allowwarningforotherdiskencryption_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "7d348597-0f2a-43db-9fad-8b55c4f89bfe",
                        "useTemplateDefault": false
                    },
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "device_vendor_msft_bitlocker_allowwarningforotherdiskencryption",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "e40531ee-2225-406b-b07b-1c17186c088c"
                },
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "1"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "device_vendor_msft_bitlocker_configurerecoverypasswordrotation_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "48278072-3b30-48e9-b654-ad683fdb9aae",
                        "useTemplateDefault": false
                    },
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "device_vendor_msft_bitlocker_configurerecoverypasswordrotation",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "48c938a7-afa0-40ef-914f-40b5da5735b4"
                },
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "2"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsfdvdropdown_name_6",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "7cd99564-6bd0-42c8-be6a-5d92c6c1faaf",
                                    "useTemplateDefault": false
                                },
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsfdvdropdown_name",
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        },
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsosdropdown_name_6",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "7cd99564-6bd0-42c8-be6a-5d92c6c1faaf",
                                    "useTemplateDefault": false
                                },
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsosdropdown_name",
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        },
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsrdvdropdown_name_3",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "7cd99564-6bd0-42c8-be6a-5d92c6c1faaf",
                                    "useTemplateDefault": false
                                },
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsrdvdropdown_name",
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        }
                    ],
                    "value": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "7cd99564-6bd0-42c8-be6a-5d92c6c1faaf",
                        "useTemplateDefault": false
                    },
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "d1625438-8db8-424f-b605-cf001b7a2f97"
                },
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "3"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "device_vendor_msft_bitlocker_identificationfield_0",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "a6116a90-93c2-40e1-bea8-c7dd279f35c4",
                        "useTemplateDefault": false
                    },
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "device_vendor_msft_bitlocker_identificationfield",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "3aeb9145-2c02-4086-8886-44dbe09c2f62"
                },
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "4"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "device_vendor_msft_bitlocker_systemdrivesencryptiontype_osencryptiontypedropdown_name_1",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "54f346c7-008f-421c-bcb5-40f822bb97fe",
                                    "useTemplateDefault": false
                                },
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesencryptiontype_osencryptiontypedropdown_name",
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        }
                    ],
                    "value": "device_vendor_msft_bitlocker_systemdrivesencryptiontype_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "54f346c7-008f-421c-bcb5-40f822bb97fe",
                        "useTemplateDefault": false
                    },
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesencryptiontype",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "d3e31794-1ce6-4572-ab0c-0c0f9200a509"
                },
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "5"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_0",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "f742e25d-2f09-41f7-9556-6af75960f42b",
                        "useTemplateDefault": false
                    },
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "a5673a18-196d-49a0-a460-a8f35b807b45"
                },
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "6"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "device_vendor_msft_bitlocker_systemdrivesminimumpinlength_0",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "041be1b9-62b2-478b-bb0c-fc3f712aa750",
                        "useTemplateDefault": false
                    },
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesminimumpinlength",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "0b4775b0-8f27-4d40-b68d-b4e521d91230"
                },
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "7"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "device_vendor_msft_bitlocker_systemdrivesenableprebootpinexceptionondecapabledevice_0",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "e09c3a13-cf03-406c-8e8b-28a2f22939d1",
                        "useTemplateDefault": false
                    },
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesenableprebootpinexceptionondecapabledevice",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "b11b114c-0971-42bc-9eec-ebdd73cef0cb"
                },
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "8"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "device_vendor_msft_bitlocker_systemdrivesenableprebootinputprotectorsonslates_0",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "1f53e191-0268-4d02-92df-c9b55a0d066a",
                        "useTemplateDefault": false
                    },
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesenableprebootinputprotectorsonslates",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "f85aa8db-2f1b-4568-a13d-388a504ee610"
                },
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "9"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrequireactivedirectorybackup_name_0",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "2a756c45-f135-442f-9c01-829a9c9b5407",
                                    "useTemplateDefault": false
                                },
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrequireactivedirectorybackup_name",
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        },
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverykeyusagedropdown_name_1",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "2a756c45-f135-442f-9c01-829a9c9b5407",
                                    "useTemplateDefault": false
                                },
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverykeyusagedropdown_name",
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        },
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverypasswordusagedropdown_name_1",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "2a756c45-f135-442f-9c01-829a9c9b5407",
                                    "useTemplateDefault": false
                                },
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverypasswordusagedropdown_name",
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        },
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osallowdra_name_1",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "2a756c45-f135-442f-9c01-829a9c9b5407",
                                    "useTemplateDefault": false
                                },
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osallowdra_name",
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        },
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackupdropdown_name_2",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "2a756c45-f135-442f-9c01-829a9c9b5407",
                                    "useTemplateDefault": false
                                },
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackupdropdown_name",
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        },
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_oshiderecoverypage_name_0",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "2a756c45-f135-442f-9c01-829a9c9b5407",
                                    "useTemplateDefault": false
                                },
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_oshiderecoverypage_name",
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        },
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackup_name_1",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "2a756c45-f135-442f-9c01-829a9c9b5407",
                                    "useTemplateDefault": false
                                },
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackup_name",
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        }
                    ],
                    "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "2a756c45-f135-442f-9c01-829a9c9b5407",
                        "useTemplateDefault": false
                    },
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "5a350519-4bc6-4443-9c4b-6859a054ff83"
                },
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "10"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "device_vendor_msft_bitlocker_systemdrivesrecoverymessage_0",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "28a5c364-ff08-40e7-ac4e-bdda90a10383",
                        "useTemplateDefault": false
                    },
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoverymessage",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "45dd68a2-c61f-4c29-9791-613bbf2101e5"
                },
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "11"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "device_vendor_msft_bitlocker_fixeddrivesencryptiontype_fdvencryptiontypedropdown_name_1",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "bdc82022-1c59-49a3-ac69-50e329650297",
                                    "useTemplateDefault": false
                                },
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesencryptiontype_fdvencryptiontypedropdown_name",
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        }
                    ],
                    "value": "device_vendor_msft_bitlocker_fixeddrivesencryptiontype_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "bdc82022-1c59-49a3-ac69-50e329650297",
                        "useTemplateDefault": false
                    },
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesencryptiontype",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "85a47676-5027-4b14-9f99-e4625728244a"
                },
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "12"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrequireactivedirectorybackup_name_0",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "2159ffae-55e2-406b-98b4-2ecdd9452c68",
                                    "useTemplateDefault": false
                                },
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrequireactivedirectorybackup_name",
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        },
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvhiderecoverypage_name_0",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "2159ffae-55e2-406b-98b4-2ecdd9452c68",
                                    "useTemplateDefault": false
                                },
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvhiderecoverypage_name",
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        },
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverykeyusagedropdown_name_1",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "2159ffae-55e2-406b-98b4-2ecdd9452c68",
                                    "useTemplateDefault": false
                                },
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverykeyusagedropdown_name",
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        },
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverypasswordusagedropdown_name_1",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "2159ffae-55e2-406b-98b4-2ecdd9452c68",
                                    "useTemplateDefault": false
                                },
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverypasswordusagedropdown_name",
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        },
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvallowdra_name_1",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "2159ffae-55e2-406b-98b4-2ecdd9452c68",
                                    "useTemplateDefault": false
                                },
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvallowdra_name",
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        },
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvactivedirectorybackupdropdown_name_2",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "2159ffae-55e2-406b-98b4-2ecdd9452c68",
                                    "useTemplateDefault": false
                                },
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvactivedirectorybackupdropdown_name",
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        },
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvactivedirectorybackup_name_1",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "2159ffae-55e2-406b-98b4-2ecdd9452c68",
                                    "useTemplateDefault": false
                                },
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvactivedirectorybackup_name",
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        }
                    ],
                    "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "2159ffae-55e2-406b-98b4-2ecdd9452c68",
                        "useTemplateDefault": false
                    },
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "ad21af4f-e42f-4870-85d8-1949e9adfad7"
                },
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "13"
        }
    ]
}