{
    "description": "",
    "name": "Windows - Default OneDrive Settings Policy",
    "platforms": "windows10",
    "settingCount": 8,
    "technologies": "mdm",
    "templateReference": {
        "templateFamily": "none",
        "templateId": ""
    },
    "settings": [
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "user_vendor_msft_policy_config_onedrivengscv6~policy~onedrivengsc_disablefreanimation_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_onedrivengscv6~policy~onedrivengsc_disablefreanimation",
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "0"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "user_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_disablefretutorial_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_disablefretutorial",
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "1"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "user_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_disablepersonalsync_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "user_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_disablepersonalsync",
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "2"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [
                        {
                            "simpleSettingValue": {
                                "value": "",
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
                            },
                            "settingDefinitionId": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_kfmoptinwithwizard_kfmoptinwithwizard_textbox",
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance"
                        }
                    ],
                    "value": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_kfmoptinwithwizard_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_kfmoptinwithwizard",
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "3"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_forcedlocalmassdeletedetection_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_forcedlocalmassdeletedetection",
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "4"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "device_vendor_msft_policy_config_onedrivengscv2.updates~policy~onedrivengsc_kfmoptinnowizard_kfmoptinnowizard_desktop_checkbox_1",
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "device_vendor_msft_policy_config_onedrivengscv2.updates~policy~onedrivengsc_kfmoptinnowizard_kfmoptinnowizard_desktop_checkbox",
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        },
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "device_vendor_msft_policy_config_onedrivengscv2.updates~policy~onedrivengsc_kfmoptinnowizard_kfmoptinnowizard_documents_checkbox_1",
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "device_vendor_msft_policy_config_onedrivengscv2.updates~policy~onedrivengsc_kfmoptinnowizard_kfmoptinnowizard_documents_checkbox",
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        },
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "device_vendor_msft_policy_config_onedrivengscv2.updates~policy~onedrivengsc_kfmoptinnowizard_kfmoptinnowizard_pictures_checkbox_1",
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "device_vendor_msft_policy_config_onedrivengscv2.updates~policy~onedrivengsc_kfmoptinnowizard_kfmoptinnowizard_pictures_checkbox",
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        },
                        {
                            "choiceSettingValue": {
                                "children": [],
                                "value": "device_vendor_msft_policy_config_onedrivengscv2.updates~policy~onedrivengsc_kfmoptinnowizard_kfmoptinnowizard_dropdown_0",
                                "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                            },
                            "settingDefinitionId": "device_vendor_msft_policy_config_onedrivengscv2.updates~policy~onedrivengsc_kfmoptinnowizard_kfmoptinnowizard_dropdown",
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                        },
                        {
                            "simpleSettingValue": {
                                "value": "",
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
                            },
                            "settingDefinitionId": "device_vendor_msft_policy_config_onedrivengscv2.updates~policy~onedrivengsc_kfmoptinnowizard_kfmoptinnowizard_textbox",
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance"
                        }
                    ],
                    "value": "device_vendor_msft_policy_config_onedrivengscv2.updates~policy~onedrivengsc_kfmoptinnowizard_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "device_vendor_msft_policy_config_onedrivengscv2.updates~policy~onedrivengsc_kfmoptinnowizard",
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "5"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_silentaccountconfig_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_silentaccountconfig",
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "6"
        },
        {
            "settingInstance": {
                "choiceSettingValue": {
                    "children": [],
                    "value": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_filesondemandenabled_1",
                    "@odata.type": "microsoft.graph.deviceManagementConfigurationChoiceSettingValue"
                },
                "settingDefinitionId": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_filesondemandenabled",
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
            },
            "id": "7"
        }
    ]
}