"root":{21 items
"advancedThreatProtectionRequiredSecurityLevel":"unavailable"
"deviceThreatProtectionEnabled":false
"deviceThreatProtectionRequiredSecurityLevel":"unavailable"
"managedEmailProfileRequired":false
"osMinimumVersion":"16.7.8"
"passcodeBlockSimple":true
"passcodeExpirationDays":730
"passcodeMinimumCharacterSetCount":1
"passcodeMinimumLength":12
"passcodeMinutesOfInactivityBeforeLock":60
"passcodeMinutesOfInactivityBeforeScreenTimeout":15
"passcodePreviousPasscodeBlockCount":5
"passcodeRequired":true
"passcodeRequiredType":"alphanumeric"
"restrictedApps":[]0 items
"securityBlockJailbrokenDevices":true
"description":""
"displayName":"iOS/iPadOS Compliance Policy - Marcos"
"version":1
"scheduledActionsForRule":[1 item
0:{1 item
"scheduledActionConfigurations":[1 item
0:{4 items
"actionType":"block"
"gracePeriodHours":0
"notificationMessageCCList":[]0 items
"notificationTemplateId":"00000000-0000-0000-0000-000000000000"
}
]
}
]
"@odata.type":"#microsoft.graph.iosCompliancePolicy"
}