{
    "allowedAndroidDeviceModels": [],
    "appActionIfAndroidDeviceManufacturerNotAllowed": "block",
    "appActionIfAndroidDeviceModelNotAllowed": "block",
    "appActionIfAndroidSafetyNetAppsVerificationFailed": "block",
    "appActionIfAndroidSafetyNetDeviceAttestationFailed": "block",
    "appActionIfDeviceLockNotSet": "block",
    "approvedKeyboards": [
        {
            "name": "com.google.android.inputmethod.latin",
            "value": "Gboard - the Google Keyboard"
        },
        {
            "name": "com.touchtype.swiftkey",
            "value": "SwiftKey Keyboard"
        },
        {
            "name": "com.sec.android.inputmethod",
            "value": "Samsung Keyboard"
        },
        {
            "name": "com.google.android.apps.inputmethod.hindi",
            "value": "Google Indic Keyboard"
        },
        {
            "name": "com.google.android.inputmethod.pinyin",
            "value": "Google Pinyin Input"
        },
        {
            "name": "com.google.android.inputmethod.japanese",
            "value": "Google Japanese Input"
        },
        {
            "name": "com.google.android.inputmethod.korean",
            "value": "Google Korean Input"
        },
        {
            "name": "com.google.android.apps.handwriting.ime",
            "value": "Google Handwriting Input"
        },
        {
            "name": "com.google.android.googlequicksearchbox",
            "value": "Google voice typing"
        },
        {
            "name": "com.samsung.android.svoiceime",
            "value": "Samsung voice input"
        },
        {
            "name": "com.samsung.android.honeyboard",
            "value": "Samsung Keyboard"
        }
    ],
    "biometricAuthenticationBlocked": false,
    "blockAfterCompanyPortalUpdateDeferralInDays": 0,
    "connectToVpnOnLaunch": false,
    "customBrowserDisplayName": "",
    "customBrowserPackageId": "",
    "customDialerAppDisplayName": "",
    "customDialerAppPackageId": "",
    "deployedAppCount": 1,
    "deviceLockRequired": false,
    "disableAppEncryptionIfDeviceEncryptionIsEnabled": false,
    "encryptAppData": true,
    "exemptedAppPackages": [],
    "fingerprintAndBiometricEnabled": true,
    "keyboardsRestricted": true,
    "minimumRequiredPatchVersion": "0000-00-00",
    "minimumWarningPatchVersion": "0000-00-00",
    "minimumWipePatchVersion": "0000-00-00",
    "requireClass3Biometrics": false,
    "requiredAndroidSafetyNetAppsVerificationType": "none",
    "requiredAndroidSafetyNetDeviceAttestationType": "none",
    "requiredAndroidSafetyNetEvaluationType": "basic",
    "requirePinAfterBiometricChange": false,
    "screenCaptureBlocked": true,
    "warnAfterCompanyPortalUpdateDeferralInDays": 0,
    "wipeAfterCompanyPortalUpdateDeferralInDays": 0,
    "apps": [
        {
            "mobileAppIdentifier": {
                "packageId": "com.getdropbox.dropbox",
                "@odata.type": "#microsoft.graph.androidMobileAppIdentifier"
            },
            "version": "661410520",
            "id": "com.getdropbox.dropbox.android"
        }
    ],
    "appGroupType": "selectedPublicApps",
    "targetedAppManagementLevels": "unspecified",
    "allowedDataIngestionLocations": [
        "oneDriveForBusiness",
        "sharePoint",
        "camera",
        "photoLibrary"
    ],
    "allowedDataStorageLocations": [
        "oneDriveForBusiness",
        "sharePoint"
    ],
    "allowedInboundDataTransferSources": "allApps",
    "allowedOutboundClipboardSharingExceptionLength": 0,
    "allowedOutboundClipboardSharingLevel": "managedApps",
    "allowedOutboundDataTransferDestinations": "managedApps",
    "appActionIfDeviceComplianceRequired": "block",
    "appActionIfMaximumPinRetriesExceeded": "block",
    "blockDataIngestionIntoOrganizationDocuments": false,
    "contactSyncBlocked": false,
    "dataBackupBlocked": true,
    "deviceComplianceRequired": true,
    "dialerRestrictionLevel": "blocked",
    "disableAppPinIfDevicePinIsSet": false,
    "fingerprintBlocked": false,
    "managedBrowser": "microsoftEdge",
    "managedBrowserToOpenLinksRequired": true,
    "maximumAllowedDeviceThreatLevel": "notConfigured",
    "maximumPinRetries": 10,
    "minimumPinLength": 4,
    "mobileThreatDefenseRemediationAction": "block",
    "notificationRestriction": "allow",
    "organizationalCredentialsRequired": false,
    "periodBeforePinReset": "PT0S",
    "periodOfflineBeforeAccessCheck": "P5D",
    "periodOfflineBeforeWipeIsEnforced": "P90D",
    "periodOnlineBeforeAccessCheck": "PT30M",
    "pinCharacterSet": "numeric",
    "pinRequired": false,
    "pinRequiredInsteadOfBiometricTimeout": "PT30M",
    "previousPinBlockCount": 0,
    "printBlocked": true,
    "saveAsBlocked": true,
    "simplePinBlocked": false,
    "description": "",
    "displayName": "DropBox - App Protection Policy - Android",
    "version": "\"ad00276f-0000-0100-0000-66b268d90000\"",
    "@odata.type": "microsoft.graph.androidManagedAppProtection"
}